src/cf/Tasks/ЗадачаИсполнителя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Task>
		<Properties>
			<Name>ЗадачаИсполнителя</Name>
			<Addressing>InformationRegister.ИсполнителиЗадач</Addressing>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаВМиллисекундах</Name>
					<Comment>для корректного замера времени</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<AddressingAttribute>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

src/cf/Tasks/ЗадачаИсполнителя/Ext/ObjectModule.bsl
Процедура ПриВыполнении(Отказ)
	ТекПользователь = Пользователи.ТекущийПользователь();
	Если Исполнитель <> ТекПользователь Тогда
		Исполнитель = ТекПользователь;
	КонецЕсли;
	ДатаВыполнения = ТекущаяДатаСеанса();
	ЗафиксироватьЗамерВремениРаботыПоЗадаче();
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	ДатаНачалаВМиллисекундах = ОценкаПроизводительности.НачатьЗамерВремени();
КонецПроцедуры

Процедура ЗафиксироватьЗамерВремениРаботыПоЗадаче()
	Если ЗначениеЗаполнено(ДатаНачалаВМиллисекундах) Тогда
		ИмяТочкиМаршрута = ТочкаМаршрута.Имя;
		ДанныеБП = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(БизнесПроцесс, "Номер, Статус");
		ОценкаПроизводительности.ЗакончитьЗамерВремени(
			СтрШаблон("ЗаявкаНаИзменениеВремяРаботыПоЗадаче%1", ИмяТочкиМаршрута),
			ДатаНачалаВМиллисекундах,, 
			СтрШаблон("%1,%2", ДанныеБП.Номер, ДанныеБП.Статус));
	КонецЕсли;
КонецПроцедуры
